public class Homework_1_3 {

    public static void main(String[] args) {

        // Написать метод вычисляющий выражение a * (b + (c / d)) и возвращающий результат,где a, b, c, d – входные параметры этого метода;

        int a = 10;
        int b = 15;
        int c = 30;
        int d = 10;

        int e = a * (b + (c / d));

        System.out.println(e);
    }
}
